#include "fun.h"
char name[9] = {"眼镜男"};
char a1[300] = {"我从顶楼一跃而下，正好摔在一个眼镜男跟前，他显然被吓坏了，他的手一松，"
                "怀里抱着的试卷书本散了一地，还有张试卷正好飘到了我的脸上，迅速被我脸上的血液浸透了。"};
char a2[200] = {"恍惚间，我意识到，我忘了自己自杀的理由。"};
char a3[250] = {"年纪轻轻，刚满十八，长得还行，桃花连连，经常收到小学妹的表白，还有个正在交往的同龄女朋友，"
                "人际关系良好，有一群好哥们，家庭和睦，父母婚姻美满，还有个正在上大学的老姐"};
char a4[200] = {"这样的我，为什么自杀呢？"};
char a5[200] = {"我从地上爬起来，目送救护车拖走我的尸体，来来往往的人群毫无知觉的穿过我的身体，"
               "只有那个被吓得不轻的眼镜男愣愣地看着我。"};
char a6[100] = {"我冲他挥挥手，他惊的倒退几步，撒腿跑了。"};
char a7[250] = {"我大步走向校门，得赶紧赶上救护车，看看医生如何处理我的尸体，"
               "在那儿大概率能碰上哭晕的妈妈和姐姐还有情绪激动反复强调”我儿子不可能自杀“的爸爸。"};
char a8[200] = {"谁知我前脚刚踏出校门，后脚便回到了我做自由落体运动的地点......"
               "再反复尝试几次，结果依旧。"};
char a9[250] = {"结合生前所看过的电影，我应该是有未完成的心愿，或者是难以释怀的心结。\n"
               "是不是只要找出我自杀的理由，就能化解我内心的怨结，得以投胎转世?\n"
               "我是个鬼，我该怎么找呢？"};
char a10[100] = {"颓然地瘫坐在水泥地上，等等，我好像忘了点什么——"};
char b1[100] = {"我确信那个眼镜男看到了我，我由此找到了他。"};
char b2[200] = {"想考满分吗“我看着正在苦命复习却毫无进展的他戏谑道，若无其事的冲他笑了笑：可不可以帮个忙。"};
char b3[200] ={ "那小子果然如同我想象中的一般，尖叫着跌下座位，爬起来后冲出了教室，我没有想到的是，这家伙躲到了卫生间。"};
char b4[200] = {"我隔着厕所门叹息：哪有人躲鬼躲卫生间的，隔着门我软下语气对他说：我只是想请你帮个忙。"};
char b5[200] = {"隔着门缝，我对上他那惊慌失措的瞳孔缓缓说道：我忘了自己自杀的理由。"};
char b6[300] = {"全世界每年有将近100万人自杀，因为学业 事业 疾病 人际 情感 金钱 随便哪一方面的压力都有可能导致一个人精神崩溃选择自杀，"
                "通过服药 上吊 跳楼等等方式，"};
char b7[200] = {"我同情自杀者，但就是这样的我，怎么也会走上这条不归路呢？"};
char b8_1[300] = {"那天我苦口婆心劝钱小道劝了半天，晓之以情动之以理，好不容易全出了卫生间，他一溜烟又撒腿跑了。"};
char b8_2[100] = {"从那以后，我们上演了猫鼠大战，他逃到哪儿，我追到哪儿。"};
char b8_3[50] = {"钱小道真是个怂包。"};
char b9_1[300] = {"直到那一天，我在器材室门外听到了被锁在里边的他发出的求救声，正常人谁会被锁在器材室，一看就又是被人耍了呗。"
                "我穿过器材室的门口，看见瑟缩在角落的他，我提议：踹门试试。"};
char b9_2[200] = {"他这才提起他的脚轻轻的踢了下门，看着不太行，他索性放弃回到原地蹲下：”算了，等等吧。"};
char b10[200] = {"我双手插兜准备闪人，却看到钱小道试图抓住我的胳膊，却扑了个空，“我一个人害怕......”"};
char c1_1[100] = {"陪了钱小道一个晚上，第二天清晨，我看到了整钱小道的人——慕容泉"};//特殊显示
char c1_2[50] = {"有几分姿色，是校长的孙女"};
char c2_1[200] = {"“要是敢报告班主任，你知道后果是什么。”笑容灿烂，声音悦耳，以肯定的语气说出了一个疑问句。"};
char c2_2[80] = {"钱小道扯出一个微笑：“嗯”了一声。"};
char c2_3[50] = {"这小子喜欢慕容泉。"};
char c3[100] = {"看着她离去的背影，有些熟悉，但我怎么也没想起她与我到底是什么关系。"};
char c4_1[80] = {"第二天，钱小道又被慕容泉整了，围观的人一阵哄笑"};
char c4_2[100] = {"“给我反抗”我看着死死垂着头的钱小道说，他文斯不懂，逆来顺受。"};
char c4_3[150] = {"“如果你喜欢她想到得到她，就给老子反抗，没人会喜欢一个怂蛋。”我提高音量"};
char c5_1[100] = {"慕容泉身边的女生小声说到：小泉，会不会太过了。"};
char c5_2[100] = {"另一个女生说到：谁叫他对小泉有非分之想，他怎么能跟江阳学长比嘛。"};
char c5_3[100] = {"慕容泉刹地沉下脸：谁准你们提他名字。"};//特殊显示
char c6[150] = {"我盯着慕容泉的脸，脑袋飞速运转，猛然惊醒，她是其中一个和我表白的总偷偷跟在我身后的小学妹。"};
char c7[200] = {"月考的日子到了，我顺利帮助钱小道拿了满分，作为交换，"
                "他答应去找慕容泉套近乎以调查我自杀的理由。"};//空行显示
char c8_1[80] = {"“班、班长，我想......”钱小道支支吾吾靠近慕容泉"};//
char c8_2[80] = {"“滚出我的视线”慕容泉的反应如我所料"};
char c8_3[60] = {"“我想问你江阳自杀的理由，你知道吗”"};
char c8_4[50] = {"“我让你滚”"};//逐字显示
char c_1_1[100] = {"钱小道自顾自地跟慕容泉说话，撞上迎面走来的袁礼，连连道歉"};
char c_1_2[100] = {"“杀人凶手”声旁地慕容泉突然嘟囔了一句。"};
char c_1_3[100] = {"袁礼停下脚步，转身看慕容泉：你说什么？"};
char c_2[300] = {"慕容泉冲上去推了把袁礼：“那天学长无意撞见你跟黄毛在一起，他上去要拉你走，你却甩了他一巴掌，"
                 "任凭黄毛取笑奚落他，我亲眼看见了，你伤了学长的心，害死了学长，不要脸的贱货！”"};
char c_3_1[200] = {"果然，袁礼二话不说揪起慕容泉的一零就准备一巴掌扇上去，我连忙拽住袁礼的胳膊，她一拳挥在我脸上。"};
char c_3_2[50] = {"“你不愧疚吗？”"};
char c_3_3[300] = {"“愧疚？我为什么要为一个懦夫愧疚？如果他以为他的自杀会让我愧疚一辈子的话，那也太天真了，"
                   "真当自己一回事，没记错的话，你就是江阳的跟屁虫吧，看样子很痴情啊，可他跳楼当天，你去哪儿了？为什么没有跟着他？”"};
char c_4_1[50] = {"慕容泉眼神一滞，不再出声。"};
char c_4_2[50] = {"“愚蠢”袁礼丢下两个字就走了。"};
char c_5_1[300] = {"“我那天原是跟着他的，跟着的，但他回头叫我不要跟着了，我以为我被讨厌了，真就听了他的话......"
                   "那是他最后一次跟我讲话，我就不该停下来”，慕容泉死死捂住脸，眼泪从指缝留下来"};
char c_5_2[50] = {"“我不该停下的”"};//特殊显示
char d1[200] = {"按照我的指示，钱小道去找了我的女朋友袁礼，一路上，我都有在跟钱小道讲述我和袁礼的罗曼史，如何相识如何相爱，如何干柴烈火。"};
char d2[300] = {"我看到她了，好久不见，她还是一样，扎着一束高马尾，穿着规整的校服，露出白白净净细细的脖子，"
                "一如我初见。钱小道看我反应大致猜出那就是袁礼，上前问"};
char d3_1[30] = {"“是袁礼吗”"};
char d3_2[30] = {"“你是”"};
char d3_3[100] = {"“我是......江阳的朋友”钱小道刻意放轻音量，生怕打击到失去男朋友的她"};
char d3_4[50] = {"“有事儿？”她面无表情回答"};
char d4[200] = {"我和钱小道都一愣，不该是这反应啊，刚刚失去男朋友的女生，不应该是一提起男友的名字就两眼一红伤心落泪吗？"};
char d_1_1[150] = {"“我想问一下，你知不知道，江阳，呃......他为什么自杀”钱小道支支吾吾终于把话说完了"};
char d_1_2[100] = {"袁礼冷冷的看着钱小道“这种事为什么要问我？”"};
char d_1_3[50] = {"“因为你是他女朋友”"};
char d_2[300] = {"“注意，是前、女、友。”她提高音量打断钱小道的话“关于他的一切都不要来问我”\n"
                   "撂下这么一句话后，转身走人回去上课了，我难以置信的跟着袁礼，一直在她耳边问她为什么，虽然她什么都听不见......"};
char d_3_1[100] ={"相识、相爱、干柴烈火，随着我的死，这几天蒸发的干干净净"};
char d_3_2[400] = {"人死之后，就再也做不了梦，没有困意，感受不到寒冷，闻不到气味，现下已夜深人静，望着满天繁星，我记得，"
                   "第一次与袁礼接吻，也是在这样的星空下，我轻轻搂着她的肩，低头吻下她的唇，那时候，我确信，我们是相爱的。"};
char d_4[50] = {"但或许也只有我一个人确信而已。"};//特殊显示
char da1[240] = {"我自顾自地去了袁礼的教室，人在伤感的时候，第一个想到的还是温婉可人的女朋友，如果能抱抱她该有多好，"
                 "像往常一样，袁礼熟悉的手机铃声响起。她打量四周，确定无人才接起"};
char da2[50] ={"“什么事”很温柔的声音"};//延时
char da3[150] ={"我下意识贴近去听，手机里传来的是熟悉的声音“想你了呗”是陈华杉，一起长大的哥们儿"};//延时
char da4_1[30] ={"“你很烦”袁礼低笑"};
char da4_2[50] = {"“那个叫钱小道的有没有再来找你”"};
char da4_3[20] = {"“没有”"};
char da4_4[80] = {"“下次再来缠着你问江阳的事儿，我就找人办了他”"};
char da4_5[50] = {"“暂时不需要”"};
char da5_1[50] = {"“晚上住我那儿”"};
char da5_2[50] = {"“嗯”袁礼娇羞回答，没有丝毫犹豫"};
char da6[300] = {"我突然意识到了什么，猛退几步，身体穿过阳台直直摔了下去，跟上次一样，我躺在水泥地上，不一样的是，这次没有血肉模糊，也没有人把目光投向我"};
char e1[150] = {"由于我出不去校门，钱小道没跟我商量，大胆了一回，悄悄，去找了陈华杉，陈华杉退学了，在一家酒吧打工"};//s2
char e2_1[50] = {"“钱小道？”他似乎认识钱小道"};
char e2_2[80] = {"“是的”钱小道虚张声势的样子有点好笑，"};
char e2_3[80] = {"“原来江阳那种人还能交到朋友啊”"};
char e2_4[30] = {"“你什么意思”"};
char e3[400] = {"“我的意思是，他那种人，根本你没资格交到任何朋友，他不过是家里有点钱，从小被宠上天，成绩不好也可以上重点高中，"
                "打架也不会被开除，你以为我为什么会在这儿，我原有大好未来，落到这般田地，还不是拜他江阳所赐，"
                "我巴不得他赶紧消失在我的世界中，继续做朋友还不是因为他那点钱”"};//S3char
char e4[100] = {"钱小道和陈华杉扭打起来，很显然，钱小道那小身板儿只有被打的份"};
char e5[240] = {"打完钱小道，陈华杉还冷冷的补了一句“就在江阳自杀一个月前，"
                "他家破产了我特地趁那时候故意将自己和袁礼的事儿暴露给他，目的就是亲自把他逼上绝路”"};
char e6[20] = {"............"};
char e7[100] = {"钱小道回校了，看着他伤痕累累，我该猜到，他去找陈华杉了"};
char e_1[80] = {"我难以置信地离开了，我似乎记起了一些东西"};
char e_2[100] = {"相识、相爱、干柴烈火，随着我的死，这几天蒸发的干干净净"};
char e_3[400] = {"人死之后，就再也做不了梦，没有困意，感受不到寒冷，闻不到气味，现下已夜深人静，望着满天繁星，"
                 "我记得，第一次与袁礼接吻，也是在这样的星空下，我轻轻搂着她的肩，低头吻下她的唇，那时候，我确信，我们是相爱的。"};
char e_4[50] = {"但或许也只有我一个人确信而已。"};//特殊显示
char f1[100] = {"在调查的过程中，钱小道得罪了陈华杉，我和钱小道正在学校游泳池边上"};
char f2[190] = {"看到了迎面走来的陈华杉和袁礼，陈华杉一把揪住钱小道的衣领，没给他反应的时间，就把钱小道的脑袋死死的按进了游泳池"};
char f3[100] = {"我眼睁睁的看着钱小道毫无反手之力，挣扎着且挣扎的动静渐渐减小。"};//
char f4[190] = {"我哭着喊着下跪让他们停下，陈华杉不为所动，一脚将钱小道揣进游泳池，搂着袁礼的腰扬长而去"};
char f5[100] = {"我随着钱小道跳进了游泳池，试图拉他，但我忘了，我的手，什么都抓不住"};
char f6[100] = {"愣在原地看着钱小道被淹没。"};
char f7[200] = {"慌乱之间，我解锁了新技能，我可以附身，附上路过的慕容泉的身，钱小道还是被救了，被慕容泉救了，抑或是被我救了。"};
char g1[500] = {"我似乎明白了自己自杀的理由，也快灰飞烟灭了吧，在这之前，我想再看看我的家人们，回到那个我生活了18年的家，"
                "妈妈似乎没这么伤心了，稍稍能从我自杀的阴影里走出来，爸爸的公司也度过了困难，恢复运营了，我还喝上了姐姐亲手泡的茶,"
                "还是熟悉的味道，墙上挂着的我前不久刚拍的寸照，笑得很阳光，只不过，是黑白的，一切都挺好，就是少了我"};
char g2[600] = {"寸照下边是一本半开着的相册，经过姐姐的同意，我拿到相册翻看，看到了一张好久之前的照片，照片上的我在吃饭，"
                "桌子上是一道奇怪的菜：西瓜皮炒香菜，那是我四岁时的记忆，激动之下我说了一句“姐姐快看，你还记得这道菜吗，因为爸妈不在家，"
                "你第一次给我做了这到菜”，姐姐突然发疯似的捂住了头说了句“我不是故意想让你死的”，妈妈见状让我赶紧离开，"
                "说是姐姐自从我自杀就偶尔会犯病。"};
char g3[240] = {"我离开了，路上，我反复在想为什么姐姐会说出那句话，接着就是一阵眩晕，记起了自杀前的最后一通电话，姐姐的声音在脑海里回荡：求求你了，去死吧"};
char g4[500] = {"这该是一句隐忍了十八年的话吧，因为爸爸公司财务危机，终于把心声说出来了，她说我夺走了本属于她的宠爱，几年前爸妈给我们都买了保险，"
               "如果我们中的其中一个死了，公司就有救了，母亲在家里割了脉，我求她救救妈妈，但是她不打算这么做，接着她又抬高音量，"
               "“你的存在，对我来说是最大的痛苦，所以求求你，去死吧”"};
char g5[300] ={"我难以想象这些话是从我最最亲爱的姐姐嘴里说出来的，那句话一直在回荡，就这么走着，我回到了学校，脱离了慕容泉的身体，不知不觉又走上了那个自杀的天台"};
char g6[300] = {"我似乎更明白了，我不是因为女朋友和朋友的背叛而对这个世界失望的，当时站在这儿的心情应该和现在差不多吧"};
char g7[600] ={"钱小道冲上天台，他这个憨憨似乎回过神来了，一向飞扬跋扈不可一世对他嗤之以鼻的慕容泉怎么可能跳下水去救他，还亲了他，"
               "骑着摩托车夺命狂奔的陈华杉和袁礼到底在躲什么，到底是什么东西才能让他们惊吓得撞上大卡车，严谨一丝不苟的李老师家里"
               "怎么会突然闯进歹徒，能把我的姐姐吓疯的又是什么，他是该有答案，矛头是该都指向我"};
char g8_1[200] = {"“如果袁礼和陈华杉不死，说不定他们还会来害你，如果李老师不死，我总有一天会被除掉，我们不是说好要过一辈子的吗？所以谁都不能出事”"};
char g8_2[200] = {"“背负这么多条生命过一辈子吗？”钱小道连连后退，满眼失望的望向我，靠在了松动的围栏上，失脚掉了下去，如我一般，同样一个位置。"};
char g8_3[80] = {"我拉不住他，紧随他一同，跳了下去。"};
char g9[150] = {"是啊，我终于想起来了，那天，也是这样，是你钱小道放开了我的手，你说让我等你找人帮忙"};
char g10_1[30] = {"你说：“等你”"};
char g10_2[30] ={"我终于等到你了"};
int end = 0;
void Str_style1(char *s) {
    Sleep(800);
    printf("%s\n",s);
    puts(" ");
}
void Str_style2(char *s){
    printf("%s\n",s);
    puts(" ");
    system("pause");
}
void day2(void){
    puts("&***&***&***&***&***&***&");
    puts("----------第二天---------");
    system("pause");
    Str_style1(da1);
    Str_style1(da2);
    Str_style1(da3);
    system("pause");
    Str_style1(da4_1);
    Str_style1(da4_2);
    Str_style1(da4_3);
    Str_style1(da4_4);
    Str_style1(da4_5);
    system("pause");
    Str_style1(da5_1);
    Str_style1(da5_2);
    Str_style1(da6);//S2
    system("pause");
    tail();
}

void start(void){
    int cho2;
    Str_style1(a1);
    Str_style1(a2);
    Str_style2(a3);
    Str_style1(a4);
    Str_style1(a5);
    Str_style2(a6);
    Str_style1(a7);
    Str_style2(a8);
    Str_style2(a9);
    Str_style2(a10);
    choice1();
    Str_style1(b1);
    Str_style1(b2);
    Str_style2(b3);
    Str_style1(b4);
    Str_style1(b5);
    Str_style1(b6);
    Str_style2(b7);
    Str_style1(b8_1);
    Str_style1(b8_2);
    Str_style2(b8_3);
    Str_style1(b9_1);
    Str_style1(b9_2);
    Str_style1(b10);
    system("pause");
    choice2();

}
void choice1(void){
    int i, flag = 0;
    char str[100];
    puts("&***&***&***&***&***&***&***&***&***&***&***&***&***& ");
    puts("接下来，你在学校里可以寻求一个人的帮助，这个人是（   ）");
    do{
        scanf("%s",str);
        
            if(strcmp(str,name)==0){
                flag=1;
                
            }
        
        if(flag==1)
            break;
        puts("不对哦，在找找看");
    }while(flag==0);
}
void choice2(void){
    int c;
    puts("********************");
    puts("你选择：            ");
    puts("1.留下来陪他         ");
    puts("2.转身走掉           ");
    puts("********************");
    while (1){
        sta : scanf("%d",&c);

    if(c==1)//判断选项
        sence1();//根据选项来进行下一步选择
    else if(c==2)//同上
        sence2();
    else goto sta;
    }
}
void sence1(void){
    puts("“你到底怕什么，让个鬼留下来陪你，你不怕？”\n"
     "“.......”\n"
     "“其实也不是不行，帮我调查我自杀的理由吧”\n"
     "“我又不是名侦探......”\n"
     "“再见”我转身朝门口走。\n"
     "“好！”\n"
     "“要敢毁约，我缠你一辈子”我幽幽的盯着他，吓得他直哆嗦，这才乖嘛。");
    system("pause");
    choice3();

}
void sence2(void){
    puts("你错失了一个让钱小道答应帮你调查的机会，你又大废周章才能让钱小道答应帮你调查");
    system("pause");
    choice3();

}

void choice3(void){
    puts("【调查开始】");
    puts("请选择你要调查的对象：");
    puts(" ***&***&***&***&***&***&***&***&***&***&***&***&");
    puts("(1)小学妹慕容泉  (2)女朋友袁礼  (3)好哥们陈华杉");
    puts(" ***&***&***&***&***&***&***&***&***&***&***&***&");
    int a;
    sta :scanf("%d",&a);
    if(a==1)
        plot1();
    else if(a==2)
        plot2();
    else if(a==3)
        plot3();
    else goto sta;
}
void choice3_2(void){
    puts("【调查开始】");
    puts("重新选择你要调查的对象：");
    puts(" ***&***&***&***&***&***&***&***&***&***&***&***&");
    puts(" (1)女朋友袁礼  (2)好哥们陈华杉");
    puts(" ***&***&***&***&***&***&***&***&***&***&***&***&");
    int a;
    sta :scanf("%d",&a);
    if(a==1)
        plot2();
    else if(a==2)
        plot3();
    else goto sta;
}
void choice4(void){
    int a;
    puts("^^^^^^^^^^^^^^^^^^^^^^^");
    puts("   你选择：");
    puts("(1)钱小道没有滚");
    puts("(2)钱小道滚开了");
    puts("^^^^^^^^^^^^^^^^^^^^^^^");
    sta :scanf("%d",&a);
    if(a==1)
        plot1_2();
    else if(a==2)
        choice3_2();
    else goto sta;
}
void choice5(void){
    int a;
    puts("^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^");
    puts("          请你做出选择：");
    puts("(1)钱小道选择离开，因为这女的不对劲 ");
    puts("(2)钱小道没有离开，硬着头皮继续问");
    puts("^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^");
    sta :scanf("%d",&a);
    if(a==1)
        plot2_1();
    else if(a==2)
        plot2_2();
    else goto sta;
}
void choice6(void){
    int a;
    puts("-------------------------------------------------------");
    puts("   这时候，你可以选择：");
    puts("(1)钱小道因为怕江阳伤心没有将他在酒吧里发现的事情告诉江阳 ");
    puts("(2)钱小道把这件事情告诉江阳");
    puts("^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^");
    sta :scanf("%d",&a);
    if(a==1){
        puts("看着他，我也没有勉强他");
        day2();
    }
    else if(a==2)
        plot3_2();
    else goto sta;
}
void choice7(void){
    int a;
    puts("         ###可以附身###");
    puts("  你选择附上慕容泉的身去见谁");
    puts("***&***&***&***&***&***&***&***&***&***&***&***&");
    puts("|(1)钱小道                                     |");
    puts("|(2)袁礼陈华杉                                 |");
    puts("|(3)企图阻止你找到自杀理由直接灰飞烟灭的李老师 |");
    puts("^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^");
    sta :scanf("%d",&a);
    if(a==1){
        puts("我附上了慕容泉的身，为表达对钱小道的感谢之情，以慕容泉的名义，让他送我回家，"
             "路上，我亲了钱小道，那憨憨应该是第一次被女孩子亲，直接愣住了，撑在头上的伞掉在了地上，任凭雨水打在他的身上");
        system("pause");
        end1();
    }
    else if(a==2){
        puts("我去见他们的时候，他们正在骑车，一个红路灯路口，我拦下了他们，我以慕容泉的面孔，江阳的口吻对他们说："
             "好久不见你们了，我生命中两个重要的人，我在这边好孤单，吓得他们闯了红灯撞上了一辆大卡车，双双为我殉情");
        system("pause");
        end1();
    }
    else if(a==3){
        puts("我提着水果去看了李老师，跟他提起我自己的事情，他似乎醒悟我不是慕容泉，拿起水果刀想要捅我一刀，"
             "但我在防卫过程中，刀阴差阳错的就插进了李老师的心脏");
        system("pause");
        end1();

    }
    else goto sta;
}
void plot1(void){
    Str_style1(c1_1);
    Str_style1(c1_2);
    Str_style1(c2_1);
    Str_style1(c2_2);
    Str_style1(c2_3);
    system("pause");
    Str_style1(c3);
    Str_style1(c4_1);
    Str_style1(c4_2);
    Str_style1(c4_3);
    Str_style1(c5_1);
    Str_style1(c5_2);
    Str_style1(c5_3);
    system("pause");
    Str_style1(c6);
    Str_style1(c7);
    Str_style1(c8_1);
    Str_style1(c8_2);
    Str_style1(c8_3);
    Str_style1(c8_4);
    choice4();
}
void plot1_2(void){
    Str_style1(c_1_1);
    Str_style1(c_1_2);
    Str_style1(c_1_3);
    system("pause");
    Str_style1(c_2);
    Str_style1(c_3_1);
    Str_style1(c_3_2);
    Str_style1(c_3_3);
    system("pause");
    Str_style1(c_4_1);
    Str_style1(c_4_2);
    Str_style1(c_5_1);
    Str_style1(c_5_2);
    system("pause");
    tail();
}
void plot2(void){
    Str_style1(d1);
    Str_style1(d2);
    system("pause");
    Str_style1(d3_1);
    Str_style1(d3_2);
    Str_style1(d3_3);
    Str_style1(d3_4);
    system("pause");
    Str_style1(d4);
    choice5();
}
void plot2_1(void){
    puts("“没、没、没事儿”这怂样儿");
    day2();
}
void plot2_2(void){
    Str_style1(d_1_1);
    Str_style1(d_1_2);
    Str_style1(d_1_3);
    system("pause");
    Str_style1(d_2);
    system("pause");
    Str_style1(d_3_1);
    Str_style1(d_3_2);
    system("pause");
    Str_style1(d_4);
    day2();
}
void plot3(void){
    Str_style2(e1);
    Str_style1(e2_1);
    Str_style1(e2_2);
    Str_style1(e2_3);
    Str_style2(e2_4);
    Str_style2(e3);
    Str_style1(e5);
    Str_style2(e6);
    Str_style1(e7);
    choice6();
}
void end1(void){
	system("cls"); 
    Str_style2(g1);
    Str_style2(g2);
    Str_style2(g3);
    Str_style2(g4);
    Str_style2(g5);
    Str_style2(g6);
    Str_style2(g7);
    system("cls");
    Str_style1(g8_1);
    Str_style1(g8_2);
    Str_style2(g8_3);
    Str_style1(g9);
    Str_style1(g10_1);
    Str_style2(g10_2);
    puts("**&——————全剧终——————&**");
    end = 1;
    system("pause");
    mainmenu();
}
void plot3_2(void){
    Str_style1(e_1);
    Str_style1(e_2);
    Str_style2(e_3);
    Str_style2(e_4);
    tail();
}
void tail(void){
    Str_style1(f1);
    Str_style1(f2);
    Str_style2(f3);
    Str_style1(f4);
    Str_style1(f5);
    Str_style2(f6);
    Str_style2(f7);
    choice7();
}
int select1(int maxn)
{
//select进行输入合法判断，返回的是输入的值，若非法输入，则返回-1，
//传入的int类型的变量是菜单中的最大选项数
    int select;
    char s;
    scanf("%c",&s);
    //fflush(stdin);//习惯性地清除输入流
    select = (int)(s - 48);//把输入的字符转成int类型的
    if (select < 1 || select > maxn)//如果输入的比1小或者比传入的最大值大，就是非法输入了
    {
        return -1;
    }
    else
        return select;
}
void mainmenu(void){
    while(1)
    {
        puts("    《  我忘了自己自杀的理由  》    ");
        puts("-->1 开始游戏");
        puts("-->2 退出游戏");
        switch(select1(2))
        {
            case 1:
                start();
                break;

            case 2:
                system("pause");
                exit(0);
            case -1:
                system("cls");
                break;
            default:
                break;
        }
    }
}


